Repository: joansalasoler/seshat
Catalog: seshat/locales/*/LC_MESSAGES/seshat.po
Languages: ca, es

source: Unhandled exception:
ca: Excepció no gestionada:
es: Excepción no gestionada:

source: Activate the palette
ca: Activa la paleta
es: Activar la paleta

source: Reload user settings
ca: Torna a carregar la configuració de l'usuari
es: Recargar la configuración del usuario

source: Device to listen for hotkeys
ca: Dispositiu on detectar dreceres de teclat
es: Dispositivo donde escuchar atajos de teclado

source: I'm working on it —please hold on.
ca: Hi estic treballant —espera un moment, si us plau.
es: Estoy en ello —por favor, espera un momento.

source: Invalid response from model
ca: El model no ha tornat cap resposta vàlida
es: Respuesta no válida del modelo

source: Cannot connect to AI service at %s. Please check if the service is running.
ca: No es pot connectar al servei d'IA a %s. Comprova si el servei està engegat.
es: No se puede conectar al servicio de IA en %s. Comprueba si el servicio está funcionando.

source: No response could be generated.
ca: No s'ha pogut generar cap resposta.
es: No se pudo generar ninguna respuesta.

source: Unknown error
ca: Error desconegut
es: Error desconocido

source: Model or API endpoint not found: '%s' at '%s'
ca: No s'ha trobat el model o punt final de l'API: '%s' a '%s'
es: No se encontró el modelo o el punto final de la API: '%s' en '%s'

source: Could not evaluate expression
ca: No s'ha pogut avaluar l'expressió
es: No se pudo evaluar la expresión

source: Expression returned a callback.
ca: L'expressió ha tornat una funció.
es: La expresión devolvió una función.

source: Expression evaluates to nothing
ca: L'expressió no torna cap resultat
es: La expresión no devolvió ningún resultado

source: Evaluation timed out
ca: S'ha esgotat el temps màxim d'avaluació
es: Se agotó el tiempo máximo de evaluación

source: Search a task or write your own
ca: Cerca una tasca o escriu-ne una de pròpia
es: Busca una tarea o escribe la tuya propia

source: Carry on this task on the selected text
ca: Aplica aquesta tasca al text seleccionat
es: Aplicar esta tarea al texto seleccionado

source: Evaluate algebraic query
ca: Avalua aquesta consulta algebraica
es: Evaluar la consulta algebraica

source: Evaluate this algebraic expression
ca: Avalua aquesta expressió algebraica
es: Evaluar esta expresión algebraica

source: Transform to uppercase
ca: Transforma a majúscules
es: Convertir a mayúsculas

source: Transform to lowercase
ca: Transforma a minúscules
es: Convertir a minúsculas

source: Capitalize first letter of each word
ca: Converteix a majúscula inicial cada mot
es: Convertir a mayúscula inicial cada palabra

source: Trim whitespace
ca: Suprimeix els espais en blanc
es: Eliminar espacios en blanco

source: Capitalize first letter of each line
ca: Converteix a majúscula inicial cada línia
es: Convertir a mayúscula inicial cada línea

source: Delete duplicate lines
ca: Elimina les línies duplicades
es: Eliminar líneas duplicadas

source: Delete empty lines
ca: Elimina les línies buides
es: Eliminar líneas vacías

source: Reverse lines
ca: Inverteix les línies
es: Invertir las líneas

source: Sort lines ascending
ca: Ordena les línies de manera ascendent
es: Ordenar las líneas ascendentemente

source: Sort lines descending
ca: Ordena les línies de manera descendent
es: Ordenar las líneas descendentemente

source: Add a call to action after this
ca: Afegeix una crida a l'acció al final
es: Añade una llamada a la acción después de esto

source: Add humor to this text
ca: Afegeix humor a aquest text
es: Añade humor a este texto

source: Add transitions to improve coherence
ca: Afegeix transicions per millorar la coherència
es: Añade transiciones para mejorar la coherencia

source: Adjust idioms for a global audience
ca: Adapta els modismes per a un públic global
es: Adapta los modismos para una audiencia global

source: Adjust for an executive audience
ca: Adapta-ho per a un públic executiu
es: Adapta el texto para una audiencia ejecutiva

source: Brainstorm ideas based on this
ca: Genera idees a partir d'això
es: Haz una lluvia de ideas basada en esto

source: Change the tone to be more empathetic
ca: Canvia el to per fer-lo més empàtic
es: Cambia el tono para que sea más empático

source: Replace word repetitions
ca: Substitueix les repeticions de paraules
es: Reemplaza repeticiones de palabras

source: Convert into a numbered list
ca: Converteix-ho en una llista numerada
es: Convierte en una lista numerada

source: Define this word or phrase
ca: Defineix aquesta paraula o expressió
es: Define esta palabra o frase

source: Extract key facts
ca: Extreu els fets clau
es: Extrae los datos clave

source: Generate a headline based on this
ca: Genera un titular a partir d'això
es: Genera un titular basado en esto

source: Generate a metaphor for this idea
ca: Genera una metàfora per a aquesta idea
es: Genera una metáfora para esta idea

source: Give 5 alternative titles for this
ca: Proposa 5 títols alternatius
es: Propón 5 títulos alternativos para esto

source: Highlight the key points
ca: Ressalta els punts clau
es: Resalta los puntos clave

source: Improve the grammar and punctuation
ca: Millora la gramàtica i la puntuació
es: Mejora la gramática y la puntuación

source: Improve this text
ca: Millora aquest text
es: Mejora este texto

source: Localize for a British audience
ca: Adapta-ho per a un públic britànic
es: Localiza para una audiencia británica

source: Make the tone consistent throughout
ca: Fes que el to sigui coherent a tot el text
es: Haz que el tono sea coherente en todo el texto

source: Make this more concise and direct
ca: Fes-ho més concís i directe
es: Hazlo más conciso y directo

source: Make this sound more authoritative
ca: Fes que soni més autoritari
es: Haz que suene más autoritario

source: Make this sound more conversational
ca: Fes que soni més conversacional
es: Haz que suene más conversacional

source: Make this sound more engaging
ca: Fes que sigui més captivador
es: Haz que suene más atractivo

source: Make this sound more persuasive
ca: Fes que soni més convincent
es: Haz que suene más persuasivo

source: Make this suitable for an international audience
ca: Adapta-ho per a un públic internacional
es: Hazlo adecuado para una audiencia internacional

source: Organize this list logically
ca: Organitza aquesta llista de manera lògica
es: Organiza esta lista de forma lógica

source: Polish for publication
ca: Poliex-ho per a la publicació
es: Pulir para publicación

source: Rearrange for better flow
ca: Reordena-ho per millorar-ne la fluïdesa
es: Reordena para mejorar la fluidez

source: Rephrase to avoid repetition
ca: Reformula-ho per evitar repeticions
es: Reformula para evitar repeticiones

source: Replace jargon with plain language
ca: Canvia l'argot per llenguatge més planer
es: Reemplaza la jerga por lenguaje claro

source: Reword to remove redundancy
ca: Reformula-ho per eliminar redundàncies
es: Reformula para eliminar redundancias

source: Rewrite to avoid passive voice
ca: Reescriu-ho evitant la veu passiva
es: Reescribe para evitar la voz pasiva

source: Rewrite to improve clarity
ca: Reescriu-ho per millorar la claredat
es: Reescribe para mejorar la claridad

source: Rewrite to match a formal tone
ca: Reescriu-ho amb un to més formal
es: Reescribe con un tono formal

source: Rewrite to match the intended audience
ca: Reescriu-ho per adaptar-ho al públic esperat
es: Reescribe según la audiencia prevista

source: Rewrite to sound more friendly and approachable
ca: Reescriu-ho per fer-lo més proper i amable
es: Reescribe para que suene más amigable y accesible

source: Rewrite to sound more professional
ca: Reescriu-ho per fer-lo més professional
es: Reescribe para que suene más profesional

source: Rewrite with a humorous tone
ca: Reescriu-ho amb un to humorístic
es: Reescribe con un tono humorístico

source: Rewrite with a sarcastic tone
ca: Reescriu-ho amb un to sarcàstic
es: Reescribe con un tono sarcástico

source: Suggest a more precise word for this
ca: Suggereix una paraula més precisa
es: Sugiere una palabra más precisa para esto

source: Suggest 10 antonyms for this
ca: Suggereix 10 antònims d'això
es: Sugiere 10 antónimos para esto

source: Suggest 10 adjectives that intensify this
ca: Suggereix 10 adjectius que intensifiquin això
es: Sugiere 10 adjetivos que intensifiquen esto

source: Suggest 10 emotionally neutral versions of this
ca: Suggereix 10 versions emocionalment neutres d'això
es: Sugiere 10 versiones emocionalmente neutras de esto

source: Suggest 10 euphemisms for this
ca: Suggereix 10 eufemismes d'això
es: Sugiere 10 eufemismos para esto

source: Suggest 10 hypernyms for this
ca: Suggereix 10 hiperònims d'això
es: Sugiere 10 hiperónimos para esto

source: Suggest 10 hyponyms for this
ca: Suggereix 10 hipònims d'això
es: Sugiere 10 hipónimos para esto

source: Suggest 10 idioms or expressions related to this
ca: Suggereix 10 modismes o expressions relacionades
es: Sugiere 10 modismos o expresiones relacionadas

source: Suggest 10 more formal alternatives for this
ca: Suggereix 10 alternatives més formals
es: Sugiere 10 alternativas más formales

source: Suggest 10 simpler alternatives for this
ca: Suggereix 10 alternatives més simples
es: Sugiere 10 alternativas más simples

source: Suggest 10 slang alternatives for this
ca: Suggereix 10 alternatives col·loquials
es: Sugiere 10 alternativas coloquiales

source: Suggest 10 stronger or more vivid words
ca: Suggereix 10 paraules més potents o expressives
es: Sugiere 10 palabras más fuertes o vívidas

source: Suggest 10 synonyms for this
ca: Suggereix 10 sinònims d'això
es: Sugiere 10 sinónimos para esto

source: Rephrase with a more persuasive tone
ca: Reformula-ho amb un to més persuasiu
es: Reformula con un tono más persuasivo

source: Suggest 10 words that naturally go with this
ca: Suggereix 10 paraules que s'associïn amb això
es: Sugiere 10 palabras que combinen con esto

source: Translate into English
ca: Tradueix-ho a l'anglès
es: Traducir al inglés

source: Translate into Spanish
ca: Tradueix-ho al castellà
es: Traducir al español

source: Turn this into a joke
ca: Converteix-ho en una broma
es: Convierte esto en un chiste

source: Turn this into a short story
ca: Converteix-ho en un relat curt
es: Convierte esto en un cuento corto

source: Turn this into an outline
ca: Converteix-ho en un esquema
es: Convierte esto en un esquema

source: Turn this into bullet points
ca: Converteix-ho en una llista de punts
es: Convierte esto en viñetas

source: Use this word in a sentence
ca: Fes servir aquesta paraula en una frase
es: Usa esta palabra en una oración

source: Write a catchy title for this
ca: Escriu un títol atractiu per a això
es: Escribe un título llamativo para esto

source: Write a conclusion for this section
ca: Escriu una conclusió per a aquesta secció
es: Escribe una conclusión para esta sección

source: Write a poetic version of this
ca: Escriu-ne una versió poètica
es: Escribe una versión poética de esto

source: Write a short caption for social media based on this
ca: Escriu un missatge per a xarxes socials basat en això
es: Escribe un mensaje para redes sociales basado en esto
